<?php

return [
    'welcome' => <<<EOD
ОХОТА НА ВАМПУСА!
EOD,
    'disclaimer' => <<<EOD

ВНИМАНИЕ ВСЕМ ФАНАТАМ ВАМПУСА!!!
В СЕМЬЕ ПРОГРАММ ВАМПУСА ДОБАВЛЕНЫ ДВА
ИЗМЕНЕНИЯ.

    WUMP2:  НЕКОТОРЫЕ ИЗМЕНЕНИ В РАСПОЛОЖЕНИИ ПЕЩЕР
    WUMP3:  ДРУГИЕ ОПАСНОСТИ

EOD,

    'start-game' => <<<EOD
ОХОТА НАЧАЛАСЬ!
EOD,

    'cli.welcome' => "НАЖМИТЕ ВВОД ДЛЯ НАЧАЛА ИГРЫ, 'I' ДЛЯ ИНСТРУКЦИ и 'Q' ДЛЯ ВЫХОДА ",

    'exit' => 'ПОКА-ПОКА',
    'invalid-move-room' => 'НЕТ ТАКОЙ ПЕЩЕРЫ',
    'feel-draft' => 'ЧУВСТВУЮ СКВОЗНЯК',
    'feel-bats' => 'ЛЕТУЧИЕ МЫШИ ГДЕ-ТО ПОБЛИЗОСТИ!',
    'feel-wumpus' => 'ВОНЯЕТ ВАМПУСОМ!',
    'you-room' => 'ТЫ В ПЕЩЕРЕ {room}',
    'you-room-tunnels' => 'ТУНЕЛИ ВЕДУТ В ПЕЩЕРЫ {room1} {room2} {room3}',
    'super-bat-snatch' => 'ЦАП--СУПЕР ЛЕТУЧИЕ МЫШИ СХВАТИЛИ ТЕБЯ! ТЫ НЕПОЙМИ ГДЕ!',
    'wumpus-got-you' => 'ТСЫК ТСЫК ТСЫК- ВАМПУС СЪЕЛ ТЕБЯ!',
    'fell-in-pit' => 'УИИИИИИИ . . . ПРОВАЛИЛСЯ В ПЕЩЕРУ',
    'you-got-wumpus' => 'АГА! ТЫ УБИЛ ВАМПУСА!',
    'arrow-got-you' => 'АУЧ! СТРЕЛА ПОПАЛА В ТЕБЯ!',
    'wumpus-waked-up' => '...УПС! ВАМПУС РАЗБУЖЕН!',
    'random-arrow-flight' => 'НЕТ ТУНЕЛЯ В УКАЗАННУЮ ПЕЩЕРУ. СТРЕЛА ПОЛЕТЕЛА НЕВЕСТЬ КУДА!',
    'arrow-missed' => 'МИМО',
    'input-shoot-or-move' => 'СТРЕЛЯТЬ ИЛИ ИДТИ (S-M)',
    'input-where-to' => 'КУДА?',
    'input-no-of-rooms' => 'СКОЛЬКО ПЕЩЕР ПРОЛЕТЕТЬ (1-{max_arrow_energy})',
    'input-room' => 'ПЕЩЕРА #',
    'invalid-arrow-trajectory' => 'СТРЕЛА НЕ НАСТОЛЬКО КРИВАЯ - ПОПРОБУЙ ДРУГУЮ ПЕЩЕРУ',
    'invalid-shoot-room' => 'ТОЛЬКЛ ПЕЩЕРЫ 1-{max_rooms}',
    'win-game-over' => 'ХЕ ХЕ ХЕ - ВАМПУС СЪЕСТ ТЕБЯ В ДРУГОЙ РАЗ!!',
    'loose-game-over' => 'ХА ХА ХА - ТЫ ПРОИГРАЛ!'
];
